// Потрібно попросити користувача задумати число. Потім він повинен помножити це число на 2 і додати отриманого результату 7.
// Те, що сталося в результаті, потрібно ввести в діалоговому вікні prompt().
// Ви повинні видати користувачеві, скільки він задумав.

const number = +prompt(`Введіть число`);
console.log(+number);
const result = (number - 7) / 2;
console.log(result);
const answer = confirm(`Це ${result} Ви загадали?`);
console.log(answer);
if (answer) {
    alert("Ми вгадали!")
} else {
    alert("Ми не вгадали!")
}




